Week_6/sandwichr_morning_application/app/controllers/sandwiches_controller.rb

SELECT  "sandwiches".* FROM "sandwiches" WHERE "sandwiches"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "sandwiches" SET "total_calories" = ?, "updated_at" = ? WHERE "sandwiches"."id" = ?  [["total_calories", 205], ["updated_at", "2016-03-07 15:25:22.818319"], ["id", 1]]
SELECT "ingredients"."calories" FROM "ingredients" INNER JOIN "sandwich_ingredients" ON "ingredients"."id" = "sandwich_ingredients"."ingredient_id" WHERE "sandwich_ingredients"."sandwich_id" = ?  [["sandwich_id", 1]]
SELECT COUNT(*) FROM "ingredients" INNER JOIN "sandwich_ingredients" ON "ingredients"."id" = "sandwich_ingredients"."ingredient_id" WHERE "sandwich_ingredients"."sandwich_id" = ?  [["sandwich_id", 1]]
---
	def add_ingredient
		sandwich = Sandwich.find_by(id: params[:sandwich_id])
	  unless sandwich
	    render json: {error: "sandwich not found"},
	    status: 404
	    return
	  end

		ingredient = Ingredient.find(params[:ingredient_id])
	  unless ingredient
	    render json: {error: "ingredient not found"},
	    status: 404
	    return
	  end

		# total_calories = sandwich.ingredients.reduce do | sum, ing |
		# 	sum + ing.calories
		# end
		sandwich.ingredients.push(ingredient)
		total_calories = sandwich.ingredients.pluck(:calories).sum